In [1]:
# Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
x = pd.Series([12, 20, 30, 40, 50])
x

0    12
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
x.dtype

dtype('int64')

In [6]:
x.values

array([12, 20, 30, 40, 50], dtype=int64)

In [7]:
data = [450, 650, 870]
index = ['Don', 'Mike', 'Edwin']
sales = pd.Series(data, index=index)
sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [8]:
sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

In [9]:
data = [450, 650, 870]
index = ["2012", "2020", "2021"]
sales = pd.Series(data, index=index)
sales.index.name = "Year"
sales.name = "Total sales per year"
sales

Year
2012    450
2020    650
2021    870
Name: Total sales per year, dtype: int64

In [10]:
sales[2010]

IndexError: index 2010 is out of bounds for axis 0 with size 3

In [ ]:
sales.loc["2012"]

In [ ]:
sales.iloc[0]

In [ ]:
sales

In [ ]:
sales > 500

In [ ]:
sales[sales > 500]

In [ ]:
sales[sales > 500].index #FIND THE VALUES

In [ ]:
list(sales[sales > 500].values) #FIND THE VALUES

In [ ]:
sales

In [ ]:
2011 in sales

In [ ]:
650 in sales.values

In [ ]:
sales.to_dict()

In [ ]:
sales_dict = {
    "Don" : 534,
    "Mike": 453,
    "Pippo": 412
}
sales_ser = pd.Series(sales_dict)
sales_ser

In [ ]:
new_sales = pd.Series(sales_dict, index=['Don', 'Mike', 'Edwin', 'Lucy'])
new_sales

In [ ]:
np.isnan(new_sales)

In [ ]:
pd.isnull(new_sales)

In [ ]:
new_sales.loc["Lucy"]=540
new_sales

In [ ]:
# DataFrames
- Two-dimensional
- Size-mutable
- Heterogenous
- Rows and columns(records and series)

In [ ]:
sales_df = pd.DataFrame(new_sales)
sales_df

In [ ]:
data = [["adrian", 20], ["bethany", 23],["Chole", 41]]
df = pd.DataFrame(data, columns=["Name", "Age"])
df

In [ ]:
new_dict = {
    "Name": ["Tom", "Jane", "Steve", "Lucy"],
    "Sales": [250,300,350,420]
}
df_dict = pd.DataFrame(new_dict)
df_dict

In [21]:
list_dicts = [
    {"Name": "Tom", "sales": 450},
    {"Name": "Tom", "sales": 750},
    {"Name": "Tom", "sales": 4150},
    {"Name": "Tom", "sales": 350},
    {"Name": "Tom", "sales": 350},
]

df_dict = pd.DataFrame(list_dicts)
df_dict

  Name  sales
0  Tom    450
1  Tom    750
2  Tom   4150
3  Tom    350
4  Tom    350

In [22]:
list_dicts["sales"]

TypeError: list indices must be integers or slices, not str

In [12]:
list_dicts["Grade"] = ['A', 'B', 'C', 'D', 'A']
list_dicts

NameError: name 'df_dict' is not defined

In [20]:
list_dicts[["Name", "sales", "Grade"]] #return the column you just want

TypeError: list indices must be integers or slices, not list

In [26]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])
df_region = pd.DataFrame({'East':east, 'West': west})
df_region['North'] = [2000,3000,2500,4000]
df_region['South'] = [1500,2000,1500,4000]
df_region

      East  West  North  South
Q1  1000.0  1100   2000   1500
Q2  1200.0  1300   3000   2000
Q3  3400.0  2400   2500   1500
Q4     NaN  3500   4000   4000

In [27]:
df_region['years'] = ['2016','2017','2018','2019']
df_region

      East  West  North  South years
Q1  1000.0  1100   2000   1500  2016
Q2  1200.0  1300   3000   2000  2017
Q3  3400.0  2400   2500   1500  2018
Q4     NaN  3500   4000   4000  2019

In [36]:
df_region.set_index('years')
df_region

KeyError: "None of ['years'] are in the columns"

In [37]:
new_region = df_region.reindex(['2018','2019','2020','2021'])
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [41]:
re_indexed = df_region.reindex(columns = ['North', 'South', 'New'])
re_indexed

       North  South  New
years
2016    2000   1500  NaN
2017    3000   2000  NaN
2018    2500   1500  NaN
2019    4000   4000  NaN

In [42]:
re_indexed.fillna(0)

       North  South  New
years
2016    2000   1500  0.0
2017    3000   2000  0.0
2018    2500   1500  0.0
2019    4000   4000  0.0

In [48]:
new_region.fillna(0)

       North  South  New
years
2016    2000   1500  0.0
2017    3000   2000  0.0
2018    2500   1500  0.0
2019    4000   4000  0.0

In [51]:
new_region.fillna(method='ffill') #MISSING VALUE FILLING

       North  South  New
years
2016    2000   1500  NaN
2017    3000   2000  NaN
2018    2500   1500  NaN
2019    4000   4000  NaN

In [54]:
new_region.mean() #find the mean

North    2875.0
South    2250.0
New         NaN
dtype: float64

In [56]:
new_region[new_region.North >= 4000]

       North  South  New
years
2019    4000   4000  NaN

In [58]:
new_region['North'] + new_region['South']

years
2016    3500
2017    5000
2018    4000
2019    8000
dtype: int64

In [63]:
new_region['North'].add(new_region['South'], fill_value=0)

years
2016    3500
2017    5000
2018    4000
2019    8000
dtype: int64

In [66]:
pd.DataFrame(np.random.rand(4,3))

          0         1         2
0  0.625710  0.937619  0.003528
1  0.058650  0.090376  0.952282
2  0.187487  0.655099  0.833791
3  0.588522  0.103150  0.624107

In [67]:
new_region.describe()

             North        South  New
count     4.000000     4.000000  0.0
mean   2875.000000  2250.000000  NaN
std     853.912564  1190.238071  NaN
min    2000.000000  1500.000000  NaN
25%    2375.000000  1500.000000  NaN
50%    2750.000000  1750.000000  NaN
75%    3250.000000  2500.000000  NaN
max    4000.000000  4000.000000  NaN